cookie.maymays.lenny = function(kawaii)
    local lennys = {
        "(ノ͡° ͜ʖ ͡°)ノ︵┻┻",
        "( ͡° ͜ʖ ͡°)=ε✄",
        "ᕦ( ͡° ͜ʖ ͡°)ᕤ",
        "┴┬┴┤( ͡° ͜ʖ├┬┴┬",
        "ᕙ( ͡° ͜ʖ ͡°)ᕗ",
        "(つ ͡° ͜ʖ ͡°)つ",
        "( ʘ̆ ╭͜ʖ╮ ʘ̆ )",
        "( ◔ ʖ̯ ◔ )",
        "(∩ ͡ ° ʖ ͡ °) ⊃-(===>",
        "( ͡° ʖ̯ ͡°)",
        "ヽ( ͝° ͜ʖ͡°)ﾉ",
        "( ͡° ͜ʖ ͡°)>⌐■-■",
        "( ͡° ͜ʖ ͡°)",
        "ヽ(͡◕ ͜ʖ ͡◕)ﾉ",
        "╚═( ͡° ͜ʖ ͡°)═╝",
        "╰( ͡° ͜ʖ ͡° )つ──☆*:・ﾟ",
        "( ͡☉ ͜ʖ ͡☉)",
        "(ง ° ͜ ʖ °)ง",
        "ᕕ( ͡° ͜ʖ ͡°)ᕗ",
        "─=≡Σᕕ( ͡° ͜ʖ ͡°)ᕗ"
    }
    if(kawaii) then
        lennys = {
            "(✿ ◕‿◕) ᓄ✂╰U╯",
            "ლ(~•̀︿•́~)つ︻̷┻̿═━一",
            "ᕕ( ՞ ᗜ ՞ )ᕗ",
            "(◕⌂◕⊃⊃)",
            "☆*:. o(≧▽≦)o .:*☆",
            "░ ∗ ◕ ں ◕ ∗ ░",
            "(^ ◕ᴥ◕ ^)"
        }
    end

    local n = math.random(1,#lennys)

    return lennys[n]
end
