cookie.maymays.flipTable = function(unflip)
    local flips = {
        "(╯°□°)╯︵ ┻━┻",
        "(ノ ゜Д゜)ノ ︵ ┻━┻",
        "(╯°□°)╯︵ ┻━┻ ︵ ╯(°□° ╯)",
        "┬─┬﻿ ︵ /(.□. \\）",
        "(ﾉಥ益ಥ）ﾉ﻿ ┻━┻",
        "(╯°Д°）╯︵ /(.□ . \\)",
        "(╯'□')╯︵ ┻━┻",
        "(ﾉಥДಥ)ﾉ︵┻━┻･/",
        "(/ .□.)\\ ︵╰(゜Д゜)╯︵ /(.□. \\)",
        "(._.) ~ ︵ ┻━┻",
        "(ʘ∇ʘ)ク 彡 ┻━┻"
    }
    if(unflip) then
        flips = {
            "┬─┬﻿ ノ( ゜-゜ノ)",
            "(ノ^_^)ノ┻━┻ ┬─┬ ノ( ^_^ノ)"
        }
    end

    local n = math.random(1,#flips)

    return flips[n]
end
